node {
  name: "model/0/self_attn/rotary_emb/range_i32/581"
  op: "range_i32"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "0"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_2_id_19873_model/0/self_attn/rotary_emb/hpu__arange  |  Sizes = [48]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/cast_i32_to_f32/582"
  op: "cast_i32_to_f32"
  input: "model/0/self_attn/rotary_emb/range_i32/581"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "1"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_2_id_19873_model/0/self_attn/rotary_emb/hpu__arange  |  Sizes = [48]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_4  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "tensor_5_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "int32"
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/cast_i32_to_f32/583"
  op: "cast_i32_to_f32"
  input: "tensor_5_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "2"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_5_/placeholder/1  |  Sizes = [1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_7  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/div_f32/584"
  op: "div_f32"
  input: "model/0/self_attn/rotary_emb/cast_i32_to_f32/582"
  input: "model/0/self_attn/rotary_emb/cast_i32_to_f32/583"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "3"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_4  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_7  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_6_id_19885_model/0/self_attn/rotary_emb/aten__div  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/constant_f32/585"
  op: "constant_f32"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "4"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_9  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/pow_fwd_f32/586"
  op: "pow_fwd_f32"
  input: "model/0/self_attn/rotary_emb/constant_f32/585"
  input: "model/0/self_attn/rotary_emb/div_f32/584"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "5"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_9  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_6_id_19885_model/0/self_attn/rotary_emb/aten__div  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_8_id_19887_model/0/self_attn/rotary_emb/aten__pow  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "tensor_10_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 48
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/mult_fwd_f32/587"
  op: "mult_fwd_f32"
  input: "tensor_10_/placeholder/0"
  input: "model/0/self_attn/rotary_emb/pow_fwd_f32/586"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "6"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_10_/placeholder/0  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  userMemorySection(type=Persistent, id=6)  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_8_id_19887_model/0/self_attn/rotary_emb/aten__pow  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_11_id_19890_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/reciprocal_fwd_f32/588"
  op: "reciprocal_fwd_f32"
  input: "model/0/self_attn/rotary_emb/mult_fwd_f32/587"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "7"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_11_id_19890_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_12_id_19892_model/0/self_attn/rotary_emb/aten__reciprocal  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "tensor_13_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/mult_fwd_f32/589"
  op: "mult_fwd_f32"
  input: "model/0/self_attn/rotary_emb/reciprocal_fwd_f32/588"
  input: "tensor_13_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "8"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_12_id_19892_model/0/self_attn/rotary_emb/aten__reciprocal  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_13_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=7)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_14_id_19894_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  userMemorySection(type=Persistent, id=8)  |  "
    }
  }
}
node {
  name: "tensor_15_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2050
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "int32"
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/slice/590"
  op: "Slice"
  input: "tensor_15_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "9"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_15_/placeholder/0  |  Sizes = [16,2050]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131200, 8200, 4]  |  data = 0, sizeInBytes = 131200  |  isPersistent  |  userMemorySection(type=Persistent, id=9)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_16_id_19862_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,2050]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131200, 8200, 4]  |  data = 0, sizeInBytes = 131200  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/slice/591"
  op: "Slice"
  input: "model/0/self_attn/rotary_emb/slice/590"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_16_id_19862_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,2050]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131200, 8200, 4]  |  data = 0, sizeInBytes = 131200  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_17_id_19863_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/slice/592"
  op: "Slice"
  input: "model/0/self_attn/rotary_emb/slice/591"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "11"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_17_id_19863_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_18_id_19904_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/expand_dims/593"
  op: "ExpandDims"
  input: "model/0/self_attn/rotary_emb/slice/592"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "12"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_18_id_19904_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_19_id_19906_model/0/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [16,1,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/slice/594"
  op: "Slice"
  input: "model/0/self_attn/rotary_emb/expand_dims/593"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "13"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_19_id_19906_model/0/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [16,1,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_20_id_19908_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/cast_i32_to_f32/595"
  op: "cast_i32_to_f32"
  input: "model/0/self_attn/rotary_emb/slice/594"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "14"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_20_id_19908_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1,1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_22  |  Sizes = [16,1,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/expand_dims/596"
  op: "ExpandDims"
  input: "model/0/self_attn/rotary_emb/mult_fwd_f32/589"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "15"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_14_id_19894_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  userMemorySection(type=Persistent, id=8)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_23_id_19896_model/0/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/slice/597"
  op: "Slice"
  input: "model/0/self_attn/rotary_emb/expand_dims/596"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "16"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_23_id_19896_model/0/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_24_id_19898_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/expand_dims/598"
  op: "ExpandDims"
  input: "model/0/self_attn/rotary_emb/slice/597"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "17"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_24_id_19898_model/0/self_attn/rotary_emb/aten__slice  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_25_id_19900_model/0/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/broadcast/599"
  op: "Broadcast"
  input: "model/0/self_attn/rotary_emb/expand_dims/598"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "18"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_25_id_19900_model/0/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_19902_model/0/self_attn/rotary_emb/hpu__expand  |  Sizes = [16,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 4, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/batch_gemm/600"
  op: "BatchGemm"
  input: "model/0/self_attn/rotary_emb/broadcast/599"
  input: "model/0/self_attn/rotary_emb/cast_i32_to_f32/595"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "19"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "transpose_a=false, transpose_b=false"
    }
  }
  attr {
    key: "fp8BiasIn"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasIn2"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasOut"
    value {
      s: "0"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_26_id_19902_model/0/self_attn/rotary_emb/hpu__expand  |  Sizes = [16,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 4, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_22  |  Sizes = [16,1,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [64, 4, 4, 4]  |  data = 0, sizeInBytes = 64  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_27_id_19914_model/0/self_attn/rotary_emb/aten__matmul  |  Sizes = [16,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 4, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/transpose/601"
  op: "Transpose"
  input: "model/0/self_attn/rotary_emb/batch_gemm/600"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "20"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "permutation: (1,0,2)"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_27_id_19914_model/0/self_attn/rotary_emb/aten__matmul  |  Sizes = [16,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 4, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_28_id_19918_model/0/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/concat/602"
  op: "Concatenate"
  input: "model/0/self_attn/rotary_emb/transpose/601"
  input: "model/0/self_attn/rotary_emb/transpose/601"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "21"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_28_id_19918_model/0/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_28_id_19918_model/0/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_29_id_19920_model/0/self_attn/rotary_emb/aten__cat  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/sin_fwd_f32/603"
  op: "sin_fwd_f32"
  input: "model/0/self_attn/rotary_emb/concat/602"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "22"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_29_id_19920_model/0/self_attn/rotary_emb/aten__cat  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_30_id_19928_model/0/self_attn/rotary_emb/aten__sin  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
}
node {
  name: "tensor_31_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/mult_fwd_f32/604"
  op: "mult_fwd_f32"
  input: "model/0/self_attn/rotary_emb/sin_fwd_f32/603"
  input: "tensor_31_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "23"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_30_id_19928_model/0/self_attn/rotary_emb/aten__sin  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_31_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=10)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_32_id_19930_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/cast_f32_to_bf16/605"
  op: "cast_f32_to_bf16"
  input: "model/0/self_attn/rotary_emb/mult_fwd_f32/604"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "24"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_32_id_19930_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_34  |  Sizes = [16,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "model/0/self_attn/expand_dims/606"
  op: "ExpandDims"
  input: "model/0/self_attn/rotary_emb/cast_f32_to_bf16/605"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "25"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_34  |  Sizes = [16,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_35_id_19942_model/0/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "tensor_36_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BFLOAT16
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9216
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "bf16"
    }
  }
}
node {
  name: "model/0/self_attn/slice/607"
  op: "Slice"
  input: "tensor_36_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "26"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_36_/placeholder/0  |  Sizes = [16,1,9216]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [294912, 18432, 18432, 2]  |  data = 0, sizeInBytes = 294912  |  isPersistent  |  userMemorySection(type=Persistent, id=11)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_37_id_19825_model/0/self_attn/aten__slice/1  |  Sizes = [16,1,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/reshape/608"
  op: "Reshape"
  input: "model/0/self_attn/slice/607"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "27"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_37_id_19825_model/0/self_attn/aten__slice/1  |  Sizes = [16,1,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_38_id_19833_model/0/self_attn/aten__view/1  |  Sizes = [16,1,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/transpose/609"
  op: "Transpose"
  input: "model/0/self_attn/reshape/608"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "28"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "permutation: (0,2,1,3)"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_38_id_19833_model/0/self_attn/aten__view/1  |  Sizes = [16,1,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_39_id_19835_model/0/self_attn/aten__transpose/1  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/slice/610"
  op: "Slice"
  input: "model/0/self_attn/transpose/609"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "29"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_39_id_19835_model/0/self_attn/aten__transpose/1  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_40_id_19963_model/0/self_attn/aten__slice  |  Sizes = [16,32,1,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [49152, 3072, 96, 96, 2]  |  data = 0, sizeInBytes = 49152  |  "
    }
  }
}
node {
  name: "model/0/self_attn/slice/611"
  op: "Slice"
  input: "model/0/self_attn/transpose/609"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "30"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_39_id_19835_model/0/self_attn/aten__transpose/1  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_41_id_19965_model/0/self_attn/aten__slice  |  Sizes = [16,32,1,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [49152, 3072, 96, 96, 2]  |  data = 0, sizeInBytes = 49152  |  "
    }
  }
}
node {
  name: "model/0/self_attn/neg_fwd_bf16/612"
  op: "neg_fwd_bf16"
  input: "model/0/self_attn/slice/611"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "31"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_41_id_19965_model/0/self_attn/aten__slice  |  Sizes = [16,32,1,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [49152, 3072, 96, 96, 2]  |  data = 0, sizeInBytes = 49152  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_42_id_19967_model/0/self_attn/aten__neg  |  Sizes = [16,32,1,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [49152, 3072, 96, 96, 2]  |  data = 0, sizeInBytes = 49152  |  "
    }
  }
}
node {
  name: "model/0/self_attn/concat/613"
  op: "Concatenate"
  input: "model/0/self_attn/neg_fwd_bf16/612"
  input: "model/0/self_attn/slice/610"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "32"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_42_id_19967_model/0/self_attn/aten__neg  |  Sizes = [16,32,1,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [49152, 3072, 96, 96, 2]  |  data = 0, sizeInBytes = 49152  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_40_id_19963_model/0/self_attn/aten__slice  |  Sizes = [16,32,1,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [49152, 3072, 96, 96, 2]  |  data = 0, sizeInBytes = 49152  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_43_id_19969_model/0/self_attn/aten__cat  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/mult_fwd_bf16/614"
  op: "mult_fwd_bf16"
  input: "model/0/self_attn/concat/613"
  input: "model/0/self_attn/expand_dims/606"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "33"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_43_id_19969_model/0/self_attn/aten__cat  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_35_id_19942_model/0/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_44_id_19971_model/0/self_attn/aten__mul  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/cos_fwd_f32/615"
  op: "cos_fwd_f32"
  input: "model/0/self_attn/rotary_emb/concat/602"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "34"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_29_id_19920_model/0/self_attn/rotary_emb/aten__cat  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_45_id_19924_model/0/self_attn/rotary_emb/aten__cos  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/mult_fwd_f32/616"
  op: "mult_fwd_f32"
  input: "model/0/self_attn/rotary_emb/cos_fwd_f32/615"
  input: "tensor_31_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "35"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_45_id_19924_model/0/self_attn/rotary_emb/aten__cos  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_31_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=10)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_46_id_19926_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
}
node {
  name: "model/0/self_attn/rotary_emb/cast_f32_to_bf16/617"
  op: "cast_f32_to_bf16"
  input: "model/0/self_attn/rotary_emb/mult_fwd_f32/616"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "36"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_46_id_19926_model/0/self_attn/rotary_emb/aten__mul  |  Sizes = [16,1,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6144, 384, 384, 4]  |  data = 0, sizeInBytes = 6144  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_48  |  Sizes = [16,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "model/0/self_attn/expand_dims/618"
  op: "ExpandDims"
  input: "model/0/self_attn/rotary_emb/cast_f32_to_bf16/617"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "37"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_48  |  Sizes = [16,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_49_id_19940_model/0/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "model/0/self_attn/mult_fwd_bf16/619"
  op: "mult_fwd_bf16"
  input: "model/0/self_attn/transpose/609"
  input: "model/0/self_attn/expand_dims/618"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "38"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_39_id_19835_model/0/self_attn/aten__transpose/1  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_49_id_19940_model/0/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 192, 192, 2]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_50_id_19960_model/0/self_attn/aten__mul  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/add_fwd_bf16/620"
  op: "add_fwd_bf16"
  input: "model/0/self_attn/mult_fwd_bf16/619"
  input: "model/0/self_attn/mult_fwd_bf16/614"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "39"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_50_id_19960_model/0/self_attn/aten__mul  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_44_id_19971_model/0/self_attn/aten__mul  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_51_id_19973_model/0/self_attn/hpu__add  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "tensor_52_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BFLOAT16
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
        dim {
          size: 2049
        }
        dim {
          size: 32
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "bf16"
    }
  }
}
node {
  name: "model/0/self_attn/concat/621"
  op: "Concatenate"
  input: "tensor_52_/placeholder/0"
  input: "model/0/self_attn/add_fwd_bf16/620"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "40"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_52_/placeholder/0  |  Sizes = [16,32,2049,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201424896, 12589056, 393408, 192, 2]  |  data = 0, sizeInBytes = 201424896  |  isPersistent  |  userMemorySection(type=Persistent, id=12)  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_51_id_19973_model/0/self_attn/hpu__add  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_53_id_19975_model/0/self_attn/aten__cat  |  Sizes = [16,32,2050,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201523200, 12595200, 393600, 192, 2]  |  data = 0, sizeInBytes = 201523200  |  isPersistent  |  userMemorySection(type=Persistent, id=13)  |  "
    }
  }
}
node {
  name: "model/0/self_attn/slice/622"
  op: "Slice"
  input: "tensor_36_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "41"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_36_/placeholder/0  |  Sizes = [16,1,9216]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [294912, 18432, 18432, 2]  |  data = 0, sizeInBytes = 294912  |  isPersistent  |  userMemorySection(type=Persistent, id=11)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_54_id_19827_model/0/self_attn/aten__slice  |  Sizes = [16,1,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/reshape/623"
  op: "Reshape"
  input: "model/0/self_attn/slice/622"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "42"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_54_id_19827_model/0/self_attn/aten__slice  |  Sizes = [16,1,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_55_id_19837_model/0/self_attn/aten__view  |  Sizes = [16,1,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "model/0/self_attn/transpose/624"
  op: "Transpose"
  input: "model/0/self_attn/reshape/623"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "43"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "permutation: (0,2,1,3)"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_55_id_19837_model/0/self_attn/aten__view  |  Sizes = [16,1,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 6144, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_56_id_19839_model/0/self_attn/aten__transpose  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
}
node {
  name: "tensor_57_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BFLOAT16
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 96
        }
        dim {
          size: 2049
        }
        dim {
          size: 32
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "bf16"
    }
  }
}
node {
  name: "model/0/self_attn/concat/625"
  op: "Concatenate"
  input: "tensor_57_/placeholder/0"
  input: "model/0/self_attn/transpose/624"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "44"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_57_/placeholder/0  |  Sizes = [16,32,2049,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201424896, 12589056, 393408, 192, 2]  |  data = 0, sizeInBytes = 201424896  |  isPersistent  |  userMemorySection(type=Persistent, id=14)  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_56_id_19839_model/0/self_attn/aten__transpose  |  Sizes = [16,32,1,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [98304, 6144, 192, 192, 2]  |  data = 0, sizeInBytes = 98304  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_58_id_19977_model/0/self_attn/aten__cat  |  Sizes = [16,32,2050,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201523200, 12595200, 393600, 192, 2]  |  data = 0, sizeInBytes = 201523200  |  isPersistent  |  userMemorySection(type=Persistent, id=15)  |  "
    }
  }
}
node {
  name: "tensor_59_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/0/post_attention_layernorm/identity/626"
  op: "Identity"
  input: "tensor_59_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "45"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_59_/placeholder/0  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=16)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_61  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
}
node {
  name: "tensor_62_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BFLOAT16
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2050
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "bf16"
    }
  }
}
node {
  name: "model/0/self_attn/slice/627"
  op: "Slice"
  input: "tensor_62_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "46"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
