node {
  name: "model/31/self_attn/rotary_emb/range_i32/159"
  op: "range_i32"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "0"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_2_id_10317_model/31/self_attn/rotary_emb/hpu__arange  |  Sizes = [48]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820380  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/160"
  op: "cast_i32_to_f32"
  input: "model/31/self_attn/rotary_emb/range_i32/159"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "1"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_2_id_10317_model/31/self_attn/rotary_emb/hpu__arange  |  Sizes = [48]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820380  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_4  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820200  |  "
    }
  }
}
node {
  name: "tensor_5_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "int32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/161"
  op: "cast_i32_to_f32"
  input: "tensor_5_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "2"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_5_/placeholder/1  |  Sizes = [1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_7  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  location = in DRAM  |  dramOffset = 0x1800c5820300  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/div_f32/162_complex/div_f32_0"
  op: "div_f32"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/160"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/161"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "3"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_4  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820200  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_7  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  location = in DRAM  |  dramOffset = 0x1800c5820300  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_6_id_10329_model/31/self_attn/rotary_emb/aten__div  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/constant_f32/163"
  op: "constant_f32"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "4"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_9  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  location = in DRAM  |  dramOffset = 0x80000000000  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/pow_fwd_f32/164_complex/pow_fwd_f32_0_complex/pow_fwd_f32_0"
  op: "pow_fwd_f32"
  input: "model/31/self_attn/rotary_emb/constant_f32/163"
  input: "model/31/self_attn/rotary_emb/div_f32/162_complex/div_f32_0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "5"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_9  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  location = in DRAM  |  dramOffset = 0x80000000000  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_6_id_10329_model/31/self_attn/rotary_emb/aten__div  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820100  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_8_id_10331_model/31/self_attn/rotary_emb/aten__pow  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820000  |  "
    }
  }
}
node {
  name: "tensor_10_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 48
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/mult_fwd_f32/165_complex/mult_fwd_f32_0"
  op: "mult_fwd_f32"
  input: "tensor_10_/placeholder/0"
  input: "model/31/self_attn/rotary_emb/pow_fwd_f32/164_complex/pow_fwd_f32_0_complex/pow_fwd_f32_0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "6"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_10_/placeholder/0  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x60000000000  |  userMemorySection(type=Persistent, id=6)  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_8_id_10331_model/31/self_attn/rotary_emb/aten__pow  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in DRAM  |  dramOffset = 0x1800c5820000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_11_id_10334_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_8_id_10331_model/31/self_attn/rotary_emb/aten__pow, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/reciprocal_fwd_f32/166_complex/reciprocal_fwd_f32_0"
  op: "reciprocal_fwd_f32"
  input: "model/31/self_attn/rotary_emb/mult_fwd_f32/165_complex/mult_fwd_f32_0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "7"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_11_id_10334_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_8_id_10331_model/31/self_attn/rotary_emb/aten__pow, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_12_id_10336_model/31/self_attn/rotary_emb/aten__reciprocal  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_11_id_10334_model/31/self_attn/rotary_emb/aten__mul, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "tensor_15_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2048
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "int32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out1"
  op: "Reshape"
  input: "tensor_15_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "8"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_15_/placeholder/0  |  Sizes = [16,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x90000000000  |  userMemorySection(type=Persistent, id=9)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "_reshaped_3342  |  Sizes = [16,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 131072  |  isAliased = tensor_15_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "_reshaped_3342_bundle_10/split_internal/0"
  op: "Split"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out1"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "9"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "0"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3342  |  Sizes = [16,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 131072  |  isAliased = tensor_15_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "_reshaped_3342_slice_0_0_0_0_0__0__bundle_10_4019  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 0  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:1"
    value {
      s: "_reshaped_3342_slice_0_0_1_0_0__0__bundle_10_4022  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 32768  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:2"
    value {
      s: "_reshaped_3342_slice_0_0_2_0_0__0__bundle_10_4026  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 65536  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:3"
    value {
      s: "_reshaped_3342_slice_0_0_3_0_0__0__bundle_10_4030  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 98304  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "tensor_13_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/mult_fwd_f32/167_complex/mult_fwd_f32_0_bundle_10/op_0"
  op: "mult_fwd_f32"
  input: "model/31/self_attn/rotary_emb/reciprocal_fwd_f32/166_complex/reciprocal_fwd_f32_0"
  input: "tensor_13_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "1"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_12_id_10336_model/31/self_attn/rotary_emb/aten__reciprocal  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_11_id_10334_model/31/self_attn/rotary_emb/aten__mul, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_13_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x70000000000  |  userMemorySection(type=Persistent, id=7)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/expand_dims/174_bundle_10/op_1"
  op: "Reshape"
  input: "model/31/self_attn/rotary_emb/mult_fwd_f32/167_complex/mult_fwd_f32_0_bundle_10/op_0"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "11"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "2"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_23_id_10344_model/31/self_attn/rotary_emb/aten__unsqueeze_slice_0_0_0_0_0__0__bundle_10_4018  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_2"
  op: "cast_i32_to_f32"
  input: "_reshaped_3342_bundle_10/split_internal/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "12"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "3"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3342_slice_0_0_0_0_0__0__bundle_10_4019  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 0  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_0_0_0__0__bundle_10_4020  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_0_0_0__0__bundle_10_4021, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_3"
  op: "StaticReshape"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_2"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "13"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "4"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_0_0_0__0__bundle_10_4020  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_0_0_0__0__bundle_10_4021, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_20_slice_0_0_0_0_0__0__bundle_10_4021  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_4"
  op: "cast_i32_to_f32"
  input: "_reshaped_3342_bundle_10/split_internal/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "14"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "5"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3342_slice_0_0_1_0_0__0__bundle_10_4022  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 32768  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_1_0_0__0__bundle_10_4023  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_1_0_0__0__bundle_10_4024, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_5"
  op: "StaticReshape"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_4"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "15"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "6"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_1_0_0__0__bundle_10_4023  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_1_0_0__0__bundle_10_4024, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_20_slice_0_0_1_0_0__0__bundle_10_4024  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_6"
  op: "BatchGemm"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_3"
  input: "model/31/self_attn/rotary_emb/expand_dims/174_bundle_10/op_1"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "16"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "7"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "transpose_a=true, transpose_b=true"
    }
  }
  attr {
    key: "fp8BiasIn"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasIn2"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasOut"
    value {
      s: "0"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_20_slice_0_0_0_0_0__0__bundle_10_4021  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_23_id_10344_model/31/self_attn/rotary_emb/aten__unsqueeze_slice_0_0_0_0_0__0__bundle_10_4018  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_0_0_0__0__bundle_10_4025  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 0  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_9"
  op: "BatchGemm"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_5"
  input: "model/31/self_attn/rotary_emb/expand_dims/174_bundle_10/op_1"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "17"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "8"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "transpose_a=true, transpose_b=true"
    }
  }
  attr {
    key: "fp8BiasIn"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasIn2"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasOut"
    value {
      s: "0"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_20_slice_0_0_1_0_0__0__bundle_10_4024  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_23_id_10344_model/31/self_attn/rotary_emb/aten__unsqueeze_slice_0_0_0_0_0__0__bundle_10_4018  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_1_0_0__0__bundle_10_4029  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 3145728  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_7"
  op: "cast_i32_to_f32"
  input: "_reshaped_3342_bundle_10/split_internal/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "18"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "9"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3342_slice_0_0_2_0_0__0__bundle_10_4026  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 65536  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_2_0_0__0__bundle_10_4027  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_2_0_0__0__bundle_10_4028, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_8"
  op: "StaticReshape"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_7"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "19"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_2_0_0__0__bundle_10_4027  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_2_0_0__0__bundle_10_4028, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_20_slice_0_0_2_0_0__0__bundle_10_4028  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_10"
  op: "cast_i32_to_f32"
  input: "_reshaped_3342_bundle_10/split_internal/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "20"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "11"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3342_slice_0_0_3_0_0__0__bundle_10_4030  |  Sizes = [4,32,64]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = _reshaped_3342, type = concat, offset: 98304  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_3_0_0__0__bundle_10_4031  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_3_0_0__0__bundle_10_4032, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_11"
  op: "StaticReshape"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_optimized_bundle_10/op_10"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "21"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "12"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "_reshaped_3343_slice_0_0_3_0_0__0__bundle_10_4031  |  Sizes = [4,32,64]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 256, 4]  |  data = 0, sizeInBytes = 32768  |  isAliased = tensor_20_slice_0_0_3_0_0__0__bundle_10_4032, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_20_slice_0_0_3_0_0__0__bundle_10_4032  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_12"
  op: "BatchGemm"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_8"
  input: "model/31/self_attn/rotary_emb/expand_dims/174_bundle_10/op_1"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "22"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "13"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "transpose_a=true, transpose_b=true"
    }
  }
  attr {
    key: "fp8BiasIn"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasIn2"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasOut"
    value {
      s: "0"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_20_slice_0_0_2_0_0__0__bundle_10_4028  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd054100  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_23_id_10344_model/31/self_attn/rotary_emb/aten__unsqueeze_slice_0_0_0_0_0__0__bundle_10_4018  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_2_0_0__0__bundle_10_4033  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 6291456  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_13"
  op: "BatchGemm"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171_reshape_TPC_out0_bundle_10/op_11"
  input: "model/31/self_attn/rotary_emb/expand_dims/174_bundle_10/op_1"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "23"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "14"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "transpose_a=true, transpose_b=true"
    }
  }
  attr {
    key: "fp8BiasIn"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasIn2"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasOut"
    value {
      s: "0"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_20_slice_0_0_3_0_0__0__bundle_10_4032  |  Sizes = [4,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [32768, 8192, 8192, 4]  |  data = 0, sizeInBytes = 32768  |  location = in SRAM  |  sramOffset = 0x1000fffffd05c100  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_23_id_10344_model/31/self_attn/rotary_emb/aten__unsqueeze_slice_0_0_0_0_0__0__bundle_10_4018  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  isAliased = tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017, type = alias, offset: 0  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_3_0_0__0__bundle_10_4034  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 9437184  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
}
node {
  name: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_bundle_10/concat_logical_internal/0"
  op: "Concatenate"
  input: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_6"
  input: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_9"
  input: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_12"
  input: "model/31/self_attn/rotary_emb/batch_gemm/176_bundle_10/op_13"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "24"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "15"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_0_0_0__0__bundle_10_4025  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 0  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_1_0_0__0__bundle_10_4029  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 3145728  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
  attr {
    key: "inputTensor:2"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_2_0_0__0__bundle_10_4033  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 6291456  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
  attr {
    key: "inputTensor:3"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_slice_0_0_3_0_0__0__bundle_10_4034  |  Sizes = [4,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 1572864  |  isAliased = tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose, type = concat, offset: 9437184  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 6291456  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = concat, offset: 0  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
}
node {
  name: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_bundle_10/memcpy/0"
  op: "DmaMemcpy"
  input: "model/31/self_attn/rotary_emb/mult_fwd_f32/167_complex/mult_fwd_f32_0_bundle_10/op_0"
  attr {
    key: "Bundle_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "25"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "16"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_slice_0_0_0_0_0__0__bundle_10_4017  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  location = in SRAM  |  sramOffset = 0x1000fffffd054000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x80000000000  |  userMemorySection(type=Persistent, id=8)  |  "
    }
  }
}
node {
  name: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul"
  op: "OutputTensor"
  input: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul_bundle_10/memcpy/0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 48
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_memcpy_4599_internal"
  op: "DmaMemcpy"
  input: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_bundle_10/concat_logical_internal/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "26"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 6291456  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = concat, offset: 0  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_memcpy_4599  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 6291456  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = concat, offset: 192  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/concat/178"
  op: "Concatenate"
  input: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_bundle_10/concat_logical_internal/0"
  input: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_memcpy_4599_internal"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "27"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 6291456  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = concat, offset: 0  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose_memcpy_4599  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 6291456  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = concat, offset: 192  |  location = in DRAM  |  isSparseLayout  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  location = in DRAM  |  dramOffset = 0x1800c4c20000  |  "
    }
  }
}
node {
  name: "reshape_0_0"
  op: "Reshape"
  input: "model/31/self_attn/rotary_emb/concat/178"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "28"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  location = in DRAM  |  dramOffset = 0x1800c4c20000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor-3326  |  Sizes = [16,2,98304]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 393216, 4]  |  data = 0, sizeInBytes = 12582912  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "tensor_29_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "fusedTPCNode_7_0"
  op: "fused_kernel_0x649C7A90_C_f32"
  input: "reshape_0_0"
  input: "tensor_29_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "29"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor-3326  |  Sizes = [16,2,98304]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 393216, 4]  |  data = 0, sizeInBytes = 12582912  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_29_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  location = in DRAM  |  dramOffset = 0xa0000000000  |  userMemorySection(type=Persistent, id=10)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor-3327  |  Sizes = [16,2,98304]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 196608, 2]  |  data = 0, sizeInBytes = 6291456  |  location = in DRAM  |  dramOffset = 0x1800a0020000  |  "
    }
  }
}
node {
  name: "reshape_16_16"
  op: "Reshape"
  input: "fusedTPCNode_7_0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "30"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor-3327  |  Sizes = [16,2,98304]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 196608, 2]  |  data = 0, sizeInBytes = 6291456  |  location = in DRAM  |  dramOffset = 0x1800a0020000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor-3333  |  Sizes = [16,1,2,98304]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 393216, 196608, 2]  |  data = 0, sizeInBytes = 6291456  |  isAliased = tensor-3327, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "reshape_5_5"
  op: "Reshape"
  input: "model/31/self_attn/rotary_emb/concat/178"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "31"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  location = in DRAM  |  dramOffset = 0x1800c4c20000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor-3328  |  Sizes = [16,2,98304]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 393216, 4]  |  data = 0, sizeInBytes = 12582912  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "fusedTPCNode_7_1"
  op: "fused_kernel_0x8B93205D_D_f32"
  input: "reshape_5_5"
  input: "tensor_29_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "32"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor-3328  |  Sizes = [16,2,98304]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 393216, 4]  |  data = 0, sizeInBytes = 12582912  |  isAliased = tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_29_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  location = in DRAM  |  dramOffset = 0xa0000000000  |  userMemorySection(type=Persistent, id=10)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor-3329  |  Sizes = [16,2,98304]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 196608, 2]  |  data = 0, sizeInBytes = 6291456  |  location = in DRAM  |  dramOffset = 0x1800a0620000  |  "
    }
  }
}
node {
  name: "reshape_12_12"
  op: "Reshape"
  input: "fusedTPCNode_7_1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "33"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor-3329  |  Sizes = [16,2,98304]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 196608, 2]  |  data = 0, sizeInBytes = 6291456  |  location = in DRAM  |  dramOffset = 0x1800a0620000  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor-3331  |  Sizes = [16,1,2,98304]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 393216, 196608, 2]  |  data = 0, sizeInBytes = 6291456  |  isAliased = tensor-3329, type = alias, offset: 0  |  location = in DRAM  |  "
    }
  }
}
node {
  name: "tensor_34_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BFLOAT16
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9216
        }
        dim {
          size: 2048
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "bf16"
    }
  }
}
node {
  name: "model/31/self_attn/slice/205"
  op: "Slice"
  input: "tensor_34_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "34"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_34_/placeholder/0  |  Sizes = [16,2048,9216]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [603979776, 37748736, 18432, 2]  |  data = 0, sizeInBytes = 603979776  |  isPersistent  |  location = in DRAM  |  dramOffset = 0xb0000000000  |  userMemorySection(type=Persistent, id=11)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
