node {
  name: "model/31/self_attn/rotary_emb/range_i32/159"
  op: "range_i32"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "0"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_2_id_10317_model/31/self_attn/rotary_emb/hpu__arange  |  Sizes = [48]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/160"
  op: "cast_i32_to_f32"
  input: "model/31/self_attn/rotary_emb/range_i32/159"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "1"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_2_id_10317_model/31/self_attn/rotary_emb/hpu__arange  |  Sizes = [48]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_4  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "tensor_5_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "int32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/161"
  op: "cast_i32_to_f32"
  input: "tensor_5_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "2"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_5_/placeholder/1  |  Sizes = [1]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_7  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/div_f32/162"
  op: "div_f32"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/160"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/161"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "3"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_4  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_7  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_6_id_10329_model/31/self_attn/rotary_emb/aten__div  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/constant_f32/163"
  op: "constant_f32"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "4"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_9  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/pow_fwd_f32/164"
  op: "pow_fwd_f32"
  input: "model/31/self_attn/rotary_emb/constant_f32/163"
  input: "model/31/self_attn/rotary_emb/div_f32/162"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "5"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_9  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_6_id_10329_model/31/self_attn/rotary_emb/aten__div  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_8_id_10331_model/31/self_attn/rotary_emb/aten__pow  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "tensor_10_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 48
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/mult_fwd_f32/165"
  op: "mult_fwd_f32"
  input: "tensor_10_/placeholder/0"
  input: "model/31/self_attn/rotary_emb/pow_fwd_f32/164"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "6"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_10_/placeholder/0  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  userMemorySection(type=Persistent, id=6)  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_8_id_10331_model/31/self_attn/rotary_emb/aten__pow  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_11_id_10334_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/reciprocal_fwd_f32/166"
  op: "reciprocal_fwd_f32"
  input: "model/31/self_attn/rotary_emb/mult_fwd_f32/165"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "7"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_11_id_10334_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_12_id_10336_model/31/self_attn/rotary_emb/aten__reciprocal  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "tensor_13_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/mult_fwd_f32/167"
  op: "mult_fwd_f32"
  input: "model/31/self_attn/rotary_emb/reciprocal_fwd_f32/166"
  input: "tensor_13_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "8"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_12_id_10336_model/31/self_attn/rotary_emb/aten__reciprocal  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_13_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=7)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  userMemorySection(type=Persistent, id=8)  |  "
    }
  }
}
node {
  name: "tensor_15_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2048
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "int32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/slice/168"
  op: "Slice"
  input: "tensor_15_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "9"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_15_/placeholder/0  |  Sizes = [16,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  isPersistent  |  userMemorySection(type=Persistent, id=9)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_16_id_10348_model/31/self_attn/rotary_emb/aten__slice  |  Sizes = [16,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/expand_dims/169"
  op: "ExpandDims"
  input: "model/31/self_attn/rotary_emb/slice/168"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "10"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_16_id_10348_model/31/self_attn/rotary_emb/aten__slice  |  Sizes = [16,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_17_id_10350_model/31/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [16,1,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/slice/170"
  op: "Slice"
  input: "model/31/self_attn/rotary_emb/expand_dims/169"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "11"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_17_id_10350_model/31/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [16,1,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_18_id_10352_model/31/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171"
  op: "cast_i32_to_f32"
  input: "model/31/self_attn/rotary_emb/slice/170"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "12"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_18_id_10352_model/31/self_attn/rotary_emb/aten__slice  |  Sizes = [16,1,2048]  |  int32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_20  |  Sizes = [16,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/expand_dims/172"
  op: "ExpandDims"
  input: "model/31/self_attn/rotary_emb/mult_fwd_f32/167"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "13"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_14_id_10338_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 4]  |  data = 0, sizeInBytes = 192  |  isPersistent  |  userMemorySection(type=Persistent, id=8)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_21_id_10340_model/31/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/slice/173"
  op: "Slice"
  input: "model/31/self_attn/rotary_emb/expand_dims/172"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "14"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_21_id_10340_model/31/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_22_id_10342_model/31/self_attn/rotary_emb/aten__slice  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/expand_dims/174"
  op: "ExpandDims"
  input: "model/31/self_attn/rotary_emb/slice/173"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "15"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_22_id_10342_model/31/self_attn/rotary_emb/aten__slice  |  Sizes = [1,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_23_id_10344_model/31/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/broadcast/175"
  op: "Broadcast"
  input: "model/31/self_attn/rotary_emb/expand_dims/174"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "16"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_23_id_10344_model/31/self_attn/rotary_emb/aten__unsqueeze  |  Sizes = [1,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [192, 192, 4, 4]  |  data = 0, sizeInBytes = 192  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_24_id_10346_model/31/self_attn/rotary_emb/hpu__expand  |  Sizes = [16,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 4, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/batch_gemm/176"
  op: "BatchGemm"
  input: "model/31/self_attn/rotary_emb/broadcast/175"
  input: "model/31/self_attn/rotary_emb/cast_i32_to_f32/171"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "17"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "transpose_a=false, transpose_b=false"
    }
  }
  attr {
    key: "fp8BiasIn"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasIn2"
    value {
      s: "0"
    }
  }
  attr {
    key: "fp8BiasOut"
    value {
      s: "0"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_24_id_10346_model/31/self_attn/rotary_emb/hpu__expand  |  Sizes = [16,48,1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [3072, 192, 4, 4]  |  data = 0, sizeInBytes = 3072  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_20  |  Sizes = [16,1,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [131072, 8192, 8192, 4]  |  data = 0, sizeInBytes = 131072  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_25_id_10358_model/31/self_attn/rotary_emb/aten__matmul  |  Sizes = [16,48,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 8192, 4]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/transpose/177"
  op: "Transpose"
  input: "model/31/self_attn/rotary_emb/batch_gemm/176"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "18"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "permutation: (1,0,2)"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_25_id_10358_model/31/self_attn/rotary_emb/aten__matmul  |  Sizes = [16,48,2048]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 8192, 4]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 192, 4]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/concat/178"
  op: "Concatenate"
  input: "model/31/self_attn/rotary_emb/transpose/177"
  input: "model/31/self_attn/rotary_emb/transpose/177"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "19"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 192, 4]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_26_id_10362_model/31/self_attn/rotary_emb/aten__transpose  |  Sizes = [16,2048,48]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 192, 4]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/sin_fwd_f32/179"
  op: "sin_fwd_f32"
  input: "model/31/self_attn/rotary_emb/concat/178"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "20"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_28_id_10372_model/31/self_attn/rotary_emb/aten__sin  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
}
node {
  name: "tensor_29_/placeholder/1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/mult_fwd_f32/180"
  op: "mult_fwd_f32"
  input: "model/31/self_attn/rotary_emb/sin_fwd_f32/179"
  input: "tensor_29_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "21"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_28_id_10372_model/31/self_attn/rotary_emb/aten__sin  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_29_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=10)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_30_id_10374_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_f32_to_bf16/181"
  op: "cast_f32_to_bf16"
  input: "model/31/self_attn/rotary_emb/mult_fwd_f32/180"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "22"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_30_id_10374_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_32  |  Sizes = [16,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
}
node {
  name: "model/31/self_attn/expand_dims/182"
  op: "ExpandDims"
  input: "model/31/self_attn/rotary_emb/cast_f32_to_bf16/181"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "23"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_32  |  Sizes = [16,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_33_id_10386_model/31/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
}
node {
  name: "tensor_34_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BFLOAT16
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9216
        }
        dim {
          size: 2048
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "bf16"
    }
  }
}
node {
  name: "model/31/self_attn/slice/183"
  op: "Slice"
  input: "tensor_34_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "24"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_34_/placeholder/0  |  Sizes = [16,2048,9216]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [603979776, 37748736, 18432, 2]  |  data = 0, sizeInBytes = 603979776  |  isPersistent  |  userMemorySection(type=Persistent, id=11)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_35_id_10269_model/31/self_attn/aten__slice/1  |  Sizes = [16,2048,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/reshape/184"
  op: "Reshape"
  input: "model/31/self_attn/slice/183"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "25"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_35_id_10269_model/31/self_attn/aten__slice/1  |  Sizes = [16,2048,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_36_id_10277_model/31/self_attn/aten__view/1  |  Sizes = [16,2048,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/transpose/185"
  op: "Transpose"
  input: "model/31/self_attn/reshape/184"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "26"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "permutation: (0,2,1,3)"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_36_id_10277_model/31/self_attn/aten__view/1  |  Sizes = [16,2048,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_37_id_10279_model/31/self_attn/aten__transpose/1  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/slice/186"
  op: "Slice"
  input: "model/31/self_attn/transpose/185"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "27"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_37_id_10279_model/31/self_attn/aten__transpose/1  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_38_id_10406_model/31/self_attn/aten__slice  |  Sizes = [16,32,2048,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [100663296, 6291456, 196608, 96, 2]  |  data = 0, sizeInBytes = 100663296  |  "
    }
  }
}
node {
  name: "model/31/self_attn/slice/187"
  op: "Slice"
  input: "model/31/self_attn/transpose/185"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "28"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_37_id_10279_model/31/self_attn/aten__transpose/1  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_39_id_10409_model/31/self_attn/aten__slice  |  Sizes = [16,32,2048,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [100663296, 6291456, 196608, 96, 2]  |  data = 0, sizeInBytes = 100663296  |  "
    }
  }
}
node {
  name: "model/31/self_attn/neg_fwd_bf16/188"
  op: "neg_fwd_bf16"
  input: "model/31/self_attn/slice/187"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "29"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_39_id_10409_model/31/self_attn/aten__slice  |  Sizes = [16,32,2048,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [100663296, 6291456, 196608, 96, 2]  |  data = 0, sizeInBytes = 100663296  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_40_id_10411_model/31/self_attn/aten__neg  |  Sizes = [16,32,2048,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [100663296, 6291456, 196608, 96, 2]  |  data = 0, sizeInBytes = 100663296  |  "
    }
  }
}
node {
  name: "model/31/self_attn/concat/189"
  op: "Concatenate"
  input: "model/31/self_attn/neg_fwd_bf16/188"
  input: "model/31/self_attn/slice/186"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "30"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_40_id_10411_model/31/self_attn/aten__neg  |  Sizes = [16,32,2048,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [100663296, 6291456, 196608, 96, 2]  |  data = 0, sizeInBytes = 100663296  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_38_id_10406_model/31/self_attn/aten__slice  |  Sizes = [16,32,2048,48]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [100663296, 6291456, 196608, 96, 2]  |  data = 0, sizeInBytes = 100663296  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_41_id_10413_model/31/self_attn/aten__cat  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/mult_fwd_bf16/190"
  op: "mult_fwd_bf16"
  input: "model/31/self_attn/concat/189"
  input: "model/31/self_attn/expand_dims/182"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "31"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_41_id_10413_model/31/self_attn/aten__cat  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_33_id_10386_model/31/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_42_id_10415_model/31/self_attn/aten__mul  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cos_fwd_f32/191"
  op: "cos_fwd_f32"
  input: "model/31/self_attn/rotary_emb/concat/178"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "32"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_27_id_10364_model/31/self_attn/rotary_emb/aten__cat  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_43_id_10366_model/31/self_attn/rotary_emb/aten__cos  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/mult_fwd_f32/192"
  op: "mult_fwd_f32"
  input: "model/31/self_attn/rotary_emb/cos_fwd_f32/191"
  input: "tensor_29_/placeholder/1"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "33"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_43_id_10366_model/31/self_attn/rotary_emb/aten__cos  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_29_/placeholder/1  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=10)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_44_id_10370_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
}
node {
  name: "model/31/self_attn/rotary_emb/cast_f32_to_bf16/193"
  op: "cast_f32_to_bf16"
  input: "model/31/self_attn/rotary_emb/mult_fwd_f32/192"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "34"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_44_id_10370_model/31/self_attn/rotary_emb/aten__mul  |  Sizes = [16,2048,96]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [12582912, 786432, 384, 4]  |  data = 0, sizeInBytes = 12582912  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_46  |  Sizes = [16,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
}
node {
  name: "model/31/self_attn/expand_dims/194"
  op: "ExpandDims"
  input: "model/31/self_attn/rotary_emb/cast_f32_to_bf16/193"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "35"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_46  |  Sizes = [16,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_47_id_10384_model/31/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
}
node {
  name: "model/31/self_attn/mult_fwd_bf16/195"
  op: "mult_fwd_bf16"
  input: "model/31/self_attn/transpose/185"
  input: "model/31/self_attn/expand_dims/194"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "36"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_37_id_10279_model/31/self_attn/aten__transpose/1  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_47_id_10384_model/31/self_attn/aten__unsqueeze/1  |  Sizes = [16,1,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [6291456, 393216, 393216, 192, 2]  |  data = 0, sizeInBytes = 6291456  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_48_id_10404_model/31/self_attn/aten__mul  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/add_fwd_bf16/196"
  op: "add_fwd_bf16"
  input: "model/31/self_attn/mult_fwd_bf16/195"
  input: "model/31/self_attn/mult_fwd_bf16/190"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "37"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_48_id_10404_model/31/self_attn/aten__mul  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "inputTensor:1"
    value {
      s: "tensor_42_id_10415_model/31/self_attn/aten__mul  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_49_id_10417_model/31/self_attn/hpu__add  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  isPersistent  |  userMemorySection(type=Persistent, id=12)  |  "
    }
  }
}
node {
  name: "tensor_50_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "float32"
    }
  }
}
node {
  name: "model/norm/identity/197"
  op: "Identity"
  input: "tensor_50_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "38"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_50_/placeholder/0  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=13)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_52  |  Sizes = [1]  |  float32  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  "
    }
  }
}
node {
  name: "model/31/self_attn/slice/198"
  op: "Slice"
  input: "tensor_34_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "39"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_34_/placeholder/0  |  Sizes = [16,2048,9216]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [603979776, 37748736, 18432, 2]  |  data = 0, sizeInBytes = 603979776  |  isPersistent  |  userMemorySection(type=Persistent, id=11)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_53_id_10271_model/31/self_attn/aten__slice  |  Sizes = [16,2048,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/reshape/199"
  op: "Reshape"
  input: "model/31/self_attn/slice/198"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "40"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_53_id_10271_model/31/self_attn/aten__slice  |  Sizes = [16,2048,3072]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_54_id_10281_model/31/self_attn/aten__view  |  Sizes = [16,2048,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/transpose/200"
  op: "Transpose"
  input: "model/31/self_attn/reshape/199"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "41"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "permutation: (0,2,1,3)"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_54_id_10281_model/31/self_attn/aten__view  |  Sizes = [16,2048,32,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 6144, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_55_id_10283_model/31/self_attn/aten__transpose  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "tensor_56_/placeholder/0"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BFLOAT16
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2048
        }
        dim {
          size: 2048
        }
        dim {
          size: 1
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "synDataType"
    value {
      s: "bf16"
    }
  }
}
node {
  name: "model/31/self_attn/slice/201"
  op: "Slice"
  input: "tensor_56_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "42"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_56_/placeholder/0  |  Sizes = [16,1,2048,2048]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [134217728, 8388608, 8388608, 4096, 2]  |  data = 0, sizeInBytes = 134217728  |  isPersistent  |  userMemorySection(type=Persistent, id=14)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_57_id_10428_model/31/self_attn/aten__slice  |  Sizes = [16,1,2048,2048]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [134217728, 8388608, 8388608, 4096, 2]  |  data = 0, sizeInBytes = 134217728  |  "
    }
  }
}
node {
  name: "model/31/self_attn/slice/202"
  op: "Slice"
  input: "model/31/self_attn/slice/201"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "43"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_57_id_10428_model/31/self_attn/aten__slice  |  Sizes = [16,1,2048,2048]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [134217728, 8388608, 8388608, 4096, 2]  |  data = 0, sizeInBytes = 134217728  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_58_id_10430_model/31/self_attn/aten__slice  |  Sizes = [16,1,2048,2048]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [134217728, 8388608, 8388608, 4096, 2]  |  data = 0, sizeInBytes = 134217728  |  "
    }
  }
}
node {
  name: "model/31/self_attn/slice/203"
  op: "Slice"
  input: "model/31/self_attn/slice/202"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "44"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_58_id_10430_model/31/self_attn/aten__slice  |  Sizes = [16,1,2048,2048]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [134217728, 8388608, 8388608, 4096, 2]  |  data = 0, sizeInBytes = 134217728  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_59_id_10432_model/31/self_attn/aten__slice  |  Sizes = [16,1,2048,2048]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [134217728, 8388608, 8388608, 4096, 2]  |  data = 0, sizeInBytes = 134217728  |  "
    }
  }
}
node {
  name: "model/31/self_attn/transpose/204"
  op: "Transpose"
  input: "model/31/self_attn/add_fwd_bf16/196"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "45"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Parameters"
    value {
      s: "permutation: (1,0,2,3)"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_49_id_10417_model/31/self_attn/hpu__add  |  Sizes = [16,32,2048,96]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 192, 2]  |  data = 0, sizeInBytes = 201326592  |  isPersistent  |  userMemorySection(type=Persistent, id=12)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
      s: "tensor_60_id_10421_model/31/self_attn/aten__transpose  |  Sizes = [16,32,96,2048]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [201326592, 12582912, 393216, 4096, 2]  |  data = 0, sizeInBytes = 201326592  |  "
    }
  }
}
node {
  name: "model/31/self_attn/slice/205"
  op: "Slice"
  input: "tensor_34_/placeholder/0"
  attr {
    key: "Bundle_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "Exec_idx"
    value {
      s: "46"
    }
  }
  attr {
    key: "Op_idx"
    value {
      s: "N/A"
    }
  }
  attr {
    key: "inputTensor:0"
    value {
      s: "tensor_34_/placeholder/0  |  Sizes = [16,2048,9216]  |  bf16  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [603979776, 37748736, 18432, 2]  |  data = 0, sizeInBytes = 603979776  |  isPersistent  |  userMemorySection(type=Persistent, id=11)  |  "
    }
  }
  attr {
    key: "outputTensor:0"
    value {
